000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ГрафикиРаботыМагазинов/ГрафикиРаботыМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботыМагазинов</name>
  <resources>
    <name>Пятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидГрафикаРаботы</name>
    <type>
      <types>EnumRef.ВидыГрафиковРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ГрафикиРаботыМагазинов/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ГрафикРаботыИзменен" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	МассивОтборов = ОтборыСписковКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор,"Магазин");
	
	Если МассивОтборов.Количество() > 0 Тогда
		
		Отбор         = Новый Структура("Магазин",МассивОтборов[0].ПравоеЗначение);
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",Новый Структура("Отбор",Отбор), ЭтотОбъект);
		
	Иначе
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей", ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура("Магазин,Год",ТекущаяСтрока.Магазин,ТекущаяСтрока.Год);
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",Новый Структура("Отбор",Отбор), ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ "Список"

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура("Магазин,Год",ТекущаяСтрока.Магазин,ТекущаяСтрока.Год);
		ОчиститьНаборЗаписейГрафикаРаботыПоОтбору(Отбор);
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура НовыйГрафикМагазина(Команда)
	
	МассивОтборов = ОтборыСписковКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор,"Магазин");
	
	Если МассивОтборов.Количество() > 0 Тогда
		
		Отбор = Новый Структура("Магазин",МассивОтборов[0].ПравоеЗначение);
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",Новый Структура("Отбор",Отбор),ЭтотОбъект);
		
	Иначе
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",,ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьГрафикРаботыМагазина(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура("Магазин,Год",ТекущаяСтрока.Магазин,ТекущаяСтрока.Год);
		ОчиститьНаборЗаписейГрафикаРаботыПоОтбору(Отбор);
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияГрафикаМагазина(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура("Магазин,Год",ТекущаяСтрока.Магазин,ТекущаяСтрока.Год);
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",Новый Структура("Отбор",Отбор), ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьГрафикРаботыМагазина(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Отбор = Новый Структура("Магазин",ТекущаяСтрока.Магазин);
		
		ОткрытьФорму("РегистрСведений.ГрафикиРаботыМагазинов.Форма.ФормаНабораЗаписей",Новый Структура("Отбор",Отбор), ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьГрафикРаботыМагазина(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("Магазин", ТекущаяСтрока.Магазин);
		СтруктураОбъекта.Вставить("Год",     ТекущаяСтрока.Год);
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(СтруктураОбъекта); 
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Справочник.Магазины",
			"ГрафикРаботы",
			ПараметрКоманды,
			ЭтотОбъект,
			Неопределено
		);
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОчиститьНаборЗаписейГрафикаРаботыПоОтбору(Отбор)
	
	Набор = РегистрыСведений.ГрафикиРаботыМагазинов.СоздатьНаборЗаписей();
	Набор.Отбор.Магазин.Установить(Отбор.Магазин);
	Набор.Отбор.Год.Установить(Отбор.Год);
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
КонецПроцедуры
